Revit 2027 API
SunAndShadowSettings.GetFrameAzimuth Method
 Identifies the azimuth of the sun (angle in radians) for a specific frame.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetFrameAzimuth(
	double frame
)
Public Function GetFrameAzimuth (
	frame As Double
) As Double
public:
double GetFrameAzimuth(
	double frame
)
member GetFrameAzimuth :
        frame : float -> float
Parameters
frame Double
 Frame for which time is requested
Return Value
Double
 Azimuth angle (radians). This is measured counterclockwise from the X axis (East direction). Note that this is a different frame of reference than is used by Revit for the Lighting Study Azimuth value.
Exceptions
Exception | Condition
ArgumentException |  the frame value frame is not valid.
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace